def my_func(x, y):
    """
    Программа принимает действительное положительное число x и целое отрицательное число y.
    Необходимо выполнить возведение числа x в степень y
    :param x: основание степени
    :param y: степень
    :return: x в степени y
    """
    if x < 0 or y > 0:
        print("введены неверные данные \nВведите действительное положительное число x и целое отрицательное число y")
        return
    return x ** y


def my_func_loop(x, y):
    """
    Программа принимает действительное положительное число x и целое отрицательное число y.
    Необходимо выполнить возведение числа x в степень y
    с использованием цикла
    :param x: основание степени
    :param y: степень
    :return: x в степени y
    """
    if x < 0 or y > 0:
        print("введены неверные данные \nВведите действительное положительное число x и целое отрицательное число y")
        return
    result = 1
    for i in range(abs(y)):
        result *= x
    return 1 / result


print(f"{my_func(23, -3):.7f}")
print(my_func_loop(23, -3))
print(my_func(-5, -6))
print(my_func_loop(5, 6))
