# 5. Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение. Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

income = int(input("Введите выручку >>> "))
costs = int(input("Введите издержки >>> "))
if income > costs:
    print("Фирма работает с прибылью ! Рентабельность составляет {}".format((income - costs) / income))
    workers = int(input("Введите численност сотрудников >>> "))
    print("Прибыль в расчёте на одного сотрудника = {}".format((income - costs) / workers))
elif income == costs:
    print("Фирма работает в 0 !")
else:
    print("Фирма работает с убытками !")
