# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который результат спортсмена составит не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
a = int(input("Введите результат первого дня (a) >>> "))
b = int(input("Введите желаемый результат (b) >>> "))
days = 1
while b > a:
    days += 1
    a *= 1.1
print("На {}-й день спортсмен достиг результата — не менее {} км".format(days, b))
